{
  ".github/workflows/deploy.yml": "Empty GitHub Actions workflow file for deployment configuration.",
  "backend/main.mo": "Main Motoko actor defining the backend canister with state and logic for user profiles, weaver profiles, products, and customers, using access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping two features (public catalog unauthenticated access and hiding the Add Product button on public pages) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key implementation details of components, pages, and hooks.",
  "frontend/.env.example": "Example environment variable file documenting the required Vite variables for canister IDs and network configuration.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom properties for light and dark theme design tokens.",
  "frontend/index.html": "HTML entry point for the Vite app, setting the page title to 'Weaver Catalog Portal' and mounting the React app via main.tsx.",
  "frontend/public/.nojekyll": "Empty file that disables Jekyll processing on GitHub Pages for the public directory.",
  "frontend/src/App.tsx": "Root React app component configuring TanStack Router with hash-based history, separating authenticated weaver routes (with PageLayout and ProfileSetupModal) from unauthenticated public catalog routes.",
  "frontend/src/components/CustomerForm.tsx": "Dialog form component for adding or editing customers with fields for name, business name, contact number (10-digit validation), address, and customer type, with inline error messages.",
  "frontend/src/components/CustomerTypeDialog.tsx": "Modal dialog for selecting a customer type (Retail, Wholesale, Direct) with icons and descriptions, used when generating share links.",
  "frontend/src/components/FeatureSection.tsx": "Renders a static 4-feature marketing section on the landing page, displaying icons, titles, and descriptions for Catalog Management, Customer Portal, Smart Sharing, and Mobile Friendly features.",
  "frontend/src/components/ImageGallery.tsx": "Displays a product image gallery with a main image viewer, previous/next navigation buttons, and a scrollable thumbnail strip, using ExternalBlob URLs.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button using Internet Identity authentication, handling login, logout, and loading states with appropriate icons and styles.",
  "frontend/src/components/LogoUpload.tsx": "Provides a circular logo upload UI with drag-and-drop, file selection, preview, upload progress, and remove functionality using ExternalBlob.",
  "frontend/src/components/MultiImageUpload.tsx": "Handles uploading multiple product images (up to a configurable max) with progress tracking, reordering via up/down buttons, and removal, using ExternalBlob.",
  "frontend/src/components/PageLayout.tsx": "Wraps pages with a responsive navigation bar and a footer crediting caffeine.ai, providing a consistent min-height flex layout.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, price (based on customer type), stock badge, and optional owner controls (edit, delete, stock toggle, share links dialog).",
  "frontend/src/components/ProductForm.tsx": "A dialog-based form component for creating and editing products, handling fields like name, prices, quantity, visibility, images, and colors with pre-population support for editing existing products.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name to set up their profile, using the useSaveCallerUserProfile mutation to persist the data.",
  "frontend/src/components/ResponsiveNav.tsx": "A sticky responsive navigation header with desktop links and a mobile hamburger menu, showing authenticated nav links and a share catalogue button when logged in.",
  "frontend/src/components/ShareLinkCard.tsx": "A card component that displays a shareable URL with a copy-to-clipboard button that shows a temporary 'Copied!' confirmation state.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor based on the current identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login/logout flows, and persisting identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including public catalog fetches (unauthenticated) and authenticated queries/mutations for products, customers, and user/weaver profiles.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind and defines a traditional Indian textile-inspired design token palette (terracotta, saffron, crimson) for both light and dark modes.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CatalogManagementPage.tsx": "Authenticated page for weavers to view, add, edit, delete, and toggle stock status of their products using a product grid and form modal.",
  "frontend/src/pages/CustomerManagementPage.tsx": "Page for managing a weaver's customer directory with a table listing customers and support for adding, editing, and deleting entries.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page with a hero section, feature section, and CTA; shows catalog navigation if the user is authenticated.",
  "frontend/src/pages/PublicCatalogPage.tsx": "Public-facing catalog page that displays a weaver's products filtered by customer type (retail/wholesale/direct) without requiring authentication.",
  "frontend/src/pages/PublicProductDetailPage.tsx": "Public product detail page showing images, pricing for a specific customer type, and stock status for a single product identified by URL params.",
  "frontend/src/pages/ShareLinksPage.tsx": "Page that generates and displays shareable catalog URLs for retail, wholesale, and direct customer types based on the authenticated weaver's principal.",
  "frontend/src/pages/WeaverProfilePage.tsx": "React page for authenticated weavers to view and update their business profile (name, address, logo), using form state populated from a profile query and saved via a mutation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for building and parsing hash-based share URLs for public catalog and product pages, and for reading secret parameters from URL search/hash query strings.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (oklch-based), fonts (Merriweather/Inter), border radii, shadows, and accordion animations, plus typography, container-queries, and animate plugins.",
  "frontend/tsconfig.node.json": "TypeScript compiler configuration for the Node/Vite build tooling context, targeting ESNext modules with bundler resolution and including only vite.config.js.",
  "project_state.json": "Project state metadata describing two known issues—customers being prompted to log in on public catalog/product pages and an 'Add Product' button incorrectly visible in customer-facing views—along with their associated fix requests."
}