{
  ".github/workflows/deploy.yml": "Empty GitHub Actions workflow file for deployment automation.",
  "backend/main.mo": "Main Motoko actor implementing weaver catalog portal with user profiles, weaver profiles, products (with multi-image support), customers, authorization, blob storage, and seamless upgrade migration.",
  "backend/migration.mo": "Migration module defining data types and a pass-through migration function for seamless state persistence across canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting frontend build process for Candid declarations and routing/asset path updates for IC canister deployment.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration with details on routing, authentication, product management with multi-image support, and styling.",
  "frontend/.env.example": "Environment variable template for canister IDs and network configuration populated by dfx during deployment.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode themes using traditional Indian textile color palette.",
  "frontend/index.html": "HTML entry point for the Weaver Catalog Portal React application with root div and module script reference.",
  "frontend/public/.nojekyll": "Empty file to disable Jekyll processing for GitHub Pages deployment.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, React Query, Internet Identity authentication, and profile setup modal flow.",
  "frontend/src/components/CustomerForm.tsx": "Modal form component for adding and editing customer records with name, customer type dropdown, and contact details fields.",
  "frontend/src/components/CustomerTypeDialog.tsx": "A dialog component that allows users to select a customer type (retail, wholesale, or direct) for generating shareable catalog links with type-specific pricing.",
  "frontend/src/components/FeatureSection.tsx": "A landing page section component that displays four feature cards highlighting catalog management, customer portal, smart sharing, and mobile-friendly capabilities.",
  "frontend/src/components/ImageGallery.tsx": "An image gallery component with main image display, navigation arrows, thumbnail strip, and image counter for viewing multiple product images.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, showing login/logout states with loading indicators and managing query cache on logout.",
  "frontend/src/components/LogoUpload.tsx": "A logo upload component with drag-and-drop support, image preview, upload progress tracking, and remove functionality using ExternalBlob for file handling.",
  "frontend/src/components/MultiImageUpload.tsx": "A multi-image upload component supporting up to 5 images with drag reordering, removal, upload progress tracking, and validation using ExternalBlob.",
  "frontend/src/components/PageLayout.tsx": "A layout wrapper component providing responsive navigation, main content area, and footer with caffeine.ai attribution link.",
  "frontend/src/components/ProductCard.tsx": "A product card component displaying product details, images, pricing for different customer types, stock management with quantity controls, and actions for edit, delete, and share.",
  "frontend/src/components/ProductForm.tsx": "A dialog form component for creating/editing products with fields for name, prices (retail/wholesale/direct), images, description, visibility, quantity, made-to-order flag, and color selection from standard and custom colors.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to enter their name to complete profile setup, using the useSaveCallerUserProfile hook to persist the data.",
  "frontend/src/components/ResponsiveNav.tsx": "A responsive navigation header with mobile hamburger menu and desktop nav links for Profile, Catalog, Customers, and Share Links, conditionally shown when authenticated.",
  "frontend/src/components/ShareLinkCard.tsx": "A card component that displays a shareable link with title, description, icon, and a copy-to-clipboard button with visual feedback.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing AuthClient creation, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, weaver profiles, products, and customers with mutations that invalidate relevant queries and show toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a traditional Indian textile color palette for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/CatalogManagementPage.tsx": "Authenticated page for managing product catalog with CRUD operations, quantity updates, and stock status toggles using React Query hooks.",
  "frontend/src/pages/CustomerManagementPage.tsx": "Authenticated page for managing customer contacts with add, edit, and delete functionality, displaying customer type badges and requiring Internet Identity login.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature section, and CTA promoting the saree catalog platform for Indian weavers, with conditional navigation based on authentication.",
  "frontend/src/pages/PublicCatalogPage.tsx": "Public-facing catalog page that displays products filtered by weaver ID and customer type (retail/wholesale/direct) with appropriate pricing, no authentication required.",
  "frontend/src/pages/PublicProductDetailPage.tsx": "Public product detail page showing full product information with image gallery, customer-type-specific pricing, and weaver branding without requiring authentication.",
  "frontend/src/pages/ShareLinksPage.tsx": "Authenticated page that generates and displays shareable catalog links for retail, wholesale, and direct customer types based on the logged-in weaver's principal.",
  "frontend/src/pages/WeaverProfilePage.tsx": "React page component for managing weaver business profiles, allowing authenticated users to edit their business name, address, and logo with form validation and submission to backend.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings with serif/sans fonts, extended spacing/shadows, and animation keyframes for accordion components.",
  "frontend/tsconfig.node.json": "TypeScript configuration for Node.js build tools (Vite) with ESNext module resolution and composite project settings.",
  "project_state.json": "Project metadata tracking deployment status to Internet Computer canisters, listing pending requirements for dfx.json configuration, frontend build process fixes, routing updates, and removal of GitHub Pages deployment artifacts."
}