{
  ".github/workflows/deploy.yml": "Empty GitHub Actions workflow file for deployment configuration.",
  "backend/main.mo": "Main Motoko actor for the Weaver Catalog Portal, defining data types and query/update methods for user profiles, weaver profiles, products, and customers, with authorization checks via AccessControl mixin.",
  "backend/migration.mo": "Motoko migration module that defines old and new actor state types and a `run` function that upgrades state by adding the `nextProductId` map to the existing actor data.",
  "feature_evidence.json": "Feature evidence report documenting the fix for the 'failed to add product' error on the Catalog Management page, listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key implementation details of components, hooks, and pages.",
  "frontend/.env.example": "Example environment variable file for the frontend, showing required Vite variables for backend/frontend canister IDs and DFX network configuration.",
  "frontend/index.css": "Global CSS file importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "HTML entry point for the Vite/React app, mounting the root div and loading the main TypeScript module for the Weaver Catalog Portal.",
  "frontend/public/.nojekyll": "Empty file that prevents GitHub Pages from processing the public directory with Jekyll.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with hash-based history, defining weaver (authenticated) and public (unauthenticated) layout route trees, and wrapping the app in QueryClient and ThemeProvider.",
  "frontend/src/components/CustomerForm.tsx": "Dialog form component for adding or editing a customer, with fields for name, business name, contact number (10-digit validation), address, and customer type, plus inline error messages.",
  "frontend/src/components/CustomerTypeDialog.tsx": "A modal dialog component that lets users select a customer type (retail, wholesale, or direct) from a list of styled buttons with icons and descriptions.",
  "frontend/src/components/FeatureSection.tsx": "A static landing page section that displays four feature highlights (Catalog Management, Customer Portal, Smart Sharing, Mobile Friendly) in a responsive grid layout.",
  "frontend/src/components/ImageGallery.tsx": "An image gallery component that displays a main image with previous/next navigation buttons and a thumbnail strip for multi-image products using ExternalBlob URLs.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, showing loading state during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/LogoUpload.tsx": "A circular logo upload component supporting drag-and-drop and file selection, with local preview, upload progress display, and removal functionality using ExternalBlob.",
  "frontend/src/components/MultiImageUpload.tsx": "A multi-image upload component that supports uploading up to a configurable maximum number of images, with reordering (move up/down), removal, and upload progress tracking via ExternalBlob.",
  "frontend/src/components/PageLayout.tsx": "A layout wrapper component that renders the responsive navigation bar, a main content area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/ProductCard.tsx": "A product card component that displays product image, price (based on customer type), stock status, and conditionally shows owner controls (edit, delete, stock toggle, share via clipboard or WhatsApp).",
  "frontend/src/components/ProductForm.tsx": "A dialog form component for creating or editing a product, handling fields like name, prices, images, visibility, stock, and colors with validation.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts a new user to enter their name to set up their profile on first login.",
  "frontend/src/components/ResponsiveNav.tsx": "A sticky responsive navigation header with desktop links, mobile hamburger menu, share catalogue button, and login button for authenticated weavers.",
  "frontend/src/components/ShareLinkCard.tsx": "A card component that displays a shareable URL with copy-to-clipboard and WhatsApp share buttons.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing login, logout, and identity persistence via DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, weaver profiles, and product CRUD operations.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for a traditional Indian textile-inspired color palette in both light and dark modes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/CatalogManagementPage.tsx": "Page for authenticated weavers to manage their product catalog, supporting add, edit, delete, and stock toggle operations via backend mutation hooks.",
  "frontend/src/pages/CustomerManagementPage.tsx": "Page for managing a weaver's customer directory with a table view, supporting add, edit, and delete operations for retail, wholesale, and direct customers.",
  "frontend/src/pages/HomePage.tsx": "Marketing landing page with a hero section, feature highlights, and a CTA section; shows navigation to the catalog when the user is authenticated.",
  "frontend/src/pages/PublicCatalogPage.tsx": "Public-facing catalog page that displays a weaver's products filtered by customer type (retail/wholesale/direct) without requiring authentication.",
  "frontend/src/pages/PublicProductDetailPage.tsx": "Public-facing product detail page showing images, pricing based on customer type, and stock status for a single product without requiring authentication.",
  "frontend/src/pages/ShareLinksPage.tsx": "Renders a page displaying three shareable catalog URLs (retail, wholesale, direct) generated from the weaver's principal ID, each shown in a ShareLinkCard component with loading skeletons.",
  "frontend/src/pages/WeaverProfilePage.tsx": "Provides a form for weavers to view and update their business profile (name, address, logo), loading existing data on mount and saving via a mutation hook.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence and CustomerType parsing helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based colors, serif/sans font families, border radii, box shadows, and accordion animations, using typography, container-queries, and animate plugins.",
  "frontend/tsconfig.node.json": "TypeScript configuration for the Node/Vite build environment, scoped to vite.config.js with ESNext module resolution.",
  "project_state.json": "Project state metadata file tracking the current fix request to diagnose and resolve the 'failed to add product' error on the Catalog Management page."
}