{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix 'Add Product' failure error",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Diagnose and fix the 'failed to add product' error when submitting the product form on the Catalog Management page",
      "acceptanceCriteria": [
        "Clicking 'Add Product' and submitting a valid product form does not show a 'failed to add product' error toast or message.",
        "The newly added product appears in the catalog grid after successful submission.",
        "Any backend error response is caught and surfaced with a meaningful error message instead of a generic failure.",
        "The product form closes upon successful submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useAddProduct mutation to properly await the backend call, handle the returned product ID, catch errors with detailed error messages, and ensure query invalidation triggers a catalog refresh. Add proper error logging to diagnose failures."
        },
        {
          "path": "frontend/src/components/ProductForm.tsx",
          "operation": "modify",
          "description": "Update the ProductForm component to display specific error messages from the backend when product submission fails. Replace generic 'failed to add product' toasts with descriptive error details extracted from the mutation error. Ensure the form closes only on successful submission and shows validation feedback."
        },
        {
          "path": "frontend/src/pages/CatalogManagementPage.tsx",
          "operation": "modify",
          "description": "Verify that the CatalogManagementPage correctly wires the ProductForm's onSuccess callback to close the form dialog and that query invalidation properly refreshes the product grid. Add error boundary handling if the mutation fails silently."
        }
      ]
    }
  ]
}