{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove login prompt and hide Add Product button from customer-facing catalog views",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Enable anonymous access to public catalog and product detail pages without authentication prompts or redirects",
      "acceptanceCriteria": [
        "Opening a shared catalog link (e.g., /catalog/:weaverId) without being logged in loads the catalog page directly with no login prompt or redirect",
        "Opening a shared product detail link (e.g., /product/:productId) without being logged in loads the product page directly with no login prompt or redirect",
        "The backend query calls for public catalog and product data accept anonymous callers and return data without requiring authentication",
        "The router layout for public catalog and product pages has no authentication guard"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review the current router configuration with two pathless layout routes (authenticated weaver layout and public layout). Ensure the public layout route explicitly covers the PublicCatalogPage and PublicProductDetailPage routes without any authentication guards. The public layout must allow anonymous access by default."
        },
        {
          "path": "frontend/src/pages/PublicCatalogPage.tsx",
          "operation": "modify",
          "description": "Verify this page uses the backend method getPublicCatalogNonAuthenticated which accepts anonymous callers. Ensure the page component does not check authentication state or redirect unauthenticated users. Remove any conditional logic that blocks anonymous access or shows login prompts."
        },
        {
          "path": "frontend/src/pages/PublicProductDetailPage.tsx",
          "operation": "modify",
          "description": "Verify this page uses the backend method getPublicProduct which accepts anonymous callers. Ensure the page component does not check authentication state or redirect unauthenticated users. Remove any conditional logic that blocks anonymous access or shows login prompts."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the React Query hooks for public catalog and product data fetching. Ensure they use the anonymous-friendly backend methods (getPublicCatalogNonAuthenticated and getPublicProduct) and do not require an authenticated actor. Configure these queries to work with the anonymous actor provided by useActor when no identity is present."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Hide the Add Product button and owner-only controls from the public catalog page for unauthenticated customers",
      "acceptanceCriteria": [
        "When a customer visits a shared catalog link without being logged in, the 'Add Product' button is not rendered anywhere on the page",
        "When an authenticated weaver views their own catalog management page, the 'Add Product' button remains visible and functional",
        "No other owner-only controls (edit, delete, stock toggle) are visible on the public catalog page"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublicCatalogPage.tsx",
          "operation": "modify",
          "description": "Remove or conditionally hide the Add Product button and any owner-only UI controls from this page. Since this is a public customer-facing page, ensure no management controls (add, edit, delete, stock toggle, share links) are rendered. The page should display only the product grid with pricing appropriate for the customer type."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Add a prop (e.g., showOwnerControls: boolean) to conditionally render owner controls (edit, delete, toggle stock, share links). When this component is used in PublicCatalogPage, pass showOwnerControls={false} to hide all owner actions. Ensure the component displays only the product image, price, and stock status when owner controls are disabled."
        }
      ]
    }
  ]
}