{
  "backend/main.mo": "Main Motoko actor implementing a weaver catalog portal with authorization, blob storage, user/weaver profiles, product management (with multi-image support and tiered pricing), customer management, and public catalog sharing functionality.",
  "feature_evidence.json": "Feature evidence report documenting the addition of a .nojekyll file to prevent GitHub Pages from treating the deployment as a Jekyll site.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components, pages, hooks, and configuration files describing routing, authentication, product management with multi-image support, and public catalog features.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH-based color system with traditional Indian textile palette for both light and dark modes.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference.",
  "frontend/public/.nojekyll": "Empty marker file to prevent GitHub Pages from processing the site as Jekyll and ignoring files starting with underscores.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with hash-based routing, React Query, Internet Identity authentication, profile setup modal, and all route definitions for public and authenticated pages.",
  "frontend/src/components/CustomerForm.tsx": "Modal form component for adding or editing customer records with name, customer type dropdown (retail/wholesale/direct), and contact details fields.",
  "frontend/src/components/CustomerTypeDialog.tsx": "Dialog component allowing users to select a customer type (retail, wholesale, or direct) when generating shareable catalog links with type-specific pricing.",
  "frontend/src/components/FeatureSection.tsx": "Displays a grid of four feature cards highlighting catalog management, customer portal, smart sharing, and mobile-friendly capabilities with icons and descriptions.",
  "frontend/src/components/ImageGallery.tsx": "Image carousel component with main image display, navigation arrows, thumbnail strip, and image counter for viewing multiple product images.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states using Internet Identity, with loading states and query cache clearing.",
  "frontend/src/components/LogoUpload.tsx": "Single image upload component with drag-and-drop support, preview, upload progress tracking, and remove functionality for business logos.",
  "frontend/src/components/MultiImageUpload.tsx": "Multi-image upload component supporting up to 5 images with reordering (move up/down), removal, progress tracking, and cover image designation.",
  "frontend/src/components/PageLayout.tsx": "Main layout wrapper providing responsive navigation, content area, and footer with caffeine.ai attribution and copyright notice.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing image, name, prices (retail/wholesale/direct), stock status, quantity controls, and action buttons for edit, delete, and share.",
  "frontend/src/components/ProductForm.tsx": "Dialog form for creating/editing products with fields for name, prices, images, description, visibility, quantity, made-to-order flag, and color selection with standard and custom color options.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component that prompts new users to enter their name to complete profile setup, using a form with validation and the useSaveCallerUserProfile mutation hook.",
  "frontend/src/components/ResponsiveNav.tsx": "Responsive navigation header with mobile hamburger menu, desktop navigation links (Profile, Catalog, Customers, Share Links), and login button that adapts based on authentication state.",
  "frontend/src/components/ShareLinkCard.tsx": "Reusable card component that displays a shareable link with title, description, icon, and a copy-to-clipboard button with visual feedback.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including user profiles, weaver profiles, products, and customers with toast notifications for success/error states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette inspired by traditional Indian textiles, defining CSS variables for light and dark themes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/CatalogManagementPage.tsx": "Main catalog management page for weavers to add, edit, delete, and manage product inventory with quantity and stock status controls. Uses React Query hooks for CRUD operations and displays products in a responsive grid with loading and empty states.",
  "frontend/src/pages/CustomerManagementPage.tsx": "Customer management interface allowing weavers to view, add, edit, and delete customer contacts with type badges (retail/wholesale/direct). Displays customers in a table with actions and includes a modal form for customer creation/editing.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section showcasing the platform for Indian weavers, featuring sections, and CTA. Conditionally renders navigation based on authentication status.",
  "frontend/src/pages/PublicCatalogPage.tsx": "Public-facing catalog page that displays a weaver's products filtered by customer type (retail/wholesale/direct) with appropriate pricing. Accepts weaverId and customerType as URL parameters and shows weaver branding.",
  "frontend/src/pages/PublicProductDetailPage.tsx": "Public product detail page showing full product information with image gallery, pricing based on customer type, and weaver branding. Handles product not found and out-of-stock states.",
  "frontend/src/pages/ShareLinksPage.tsx": "Page for authenticated weavers to generate and copy shareable catalog links for different customer types (retail/wholesale/direct). Displays three link cards with instructions on how the sharing system works.",
  "frontend/src/pages/WeaverProfilePage.tsx": "React page component for weaver business profile management, allowing authenticated users to edit business name, address, and logo with form validation and submission handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography settings, container configurations, custom animations, and design tokens for the application theme.",
  "project_state.json": "Project metadata tracking architectural decisions, implemented features, and known issues for a mobile-friendly saree catalog management portal for Indian weavers with customer-type-specific pricing and sharing capabilities."
}